Autodesk.Revit.DB.Mesh.Transformed(Autodesk.Revit.DB.Transform)
Transforms this mesh and returns the result.
transform: The transformation used to transform the profile.
Returns: The transformed mesh.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the handle of the specified transformation is null.

Autodesk.Revit.DB.Mesh.MaterialElementId
Element ID of the material from which this mesh is composed.

Autodesk.Revit.DB.Mesh.Vertices
Retrieves all vertices used to define this mesh. Intended for indexed access.

Autodesk.Revit.DB.Mesh.Triangle(System.Int32)
Retrieves a specific triangle.
idx: Index of the triangle, must be in [0, NumTriangles).

Autodesk.Revit.DB.Mesh.NumTriangles
The number of triangles that the mesh contains.

Autodesk.Revit.DB.Mesh
A triangular mesh.
Remarks: Meshes are generated during triangulation of faces.  They can also be encountered directly in Revit geometry (typically imported geometry).
Meshes contain a single array of Autodesk.Revit.DB.Mesh.Vertices, and a corresponding array of triangles. Triangles can be accessed by index from
Autodesk.Revit.DB.Mesh.Triangle(System.Int32), and reference 3 vertices from the Autodesk.Revit.DB.Mesh.Vertices array.